[{
  "name": "Digicah",
  "type": "web",
  "link": "http://digicah.com",
  "image": "digicah.jpg",
  "buttonText": "visit website",
  "images": ["digicahA.PNG", "digicahB.PNG", "digicahC.PNG"],
  "shortDescription": "A Digital Cards Against Humanity Clone",
  "description": "Digicah was developed as a C# .NET application using WPF for the client and a command line interface for the server. It has been released in alpha and can be downloaded from the dedicated Digicah website."
},
{
  "name": "TodoDoingDone",
  "type": "web",
  "link": "https://github.com/ThatCrazyIrishGuy/TodoDoingDone",
  "image": "TodoDoingDone.jpg",
  "buttonText": "View On Github",
  "shortDescription": "An AJAX based Kanaban note management web app",
  "description": "TodoDoingDone was created out of self need for a simple, self contained, kabanan style, note management web application. Fully responsive with HTML5 drag and drop functionality and entire AJAX architecture made the creation a useful learning experience."
},
{
  "name": "Wedding Website and Dashboard",
  "type": "web",
  "image": "wedding.jpg",
  "shortDescription": "Management Dashboard and Website for Wedding RSVP",
  "description": "Created in collaboration with <a href='https://github.com/JosephDevaney' target='_blank'>Joe Devaney</a>, This project allows for the creation of a wedding website portal with RSVP service for guests with a web app management dashboard for manging RSVPS and guests. The project is currently not available."
},
{
  "name": "KIRK",
  "type": "desktop",
  "link": "https://github.com/ThatCrazyIrishGuy/KIRK",
  "image": "dani.jpg",
  "buttonText": "View On Github",
  "shortDescription": "A College Assignment To Create A Chatbot In C#",
  "description": "KIRK was created as a star trek based chatbot developed for command line access with C#. The resulting chatbot can be trained through conversation or via parsing of text files with full text-to-speech output."
},
{
  "name": "TRON: Light Cycles",
  "type": "game",
  "link": "https://github.com/ThatCrazyIrishGuy/TRON-Light-Cycles",
  "image": "tron.jpg",
  "buttonText": "View On Github",
  "shortDescription": "A Twitch Puzzle Game With Scalable Difficulty",
  "description": "TRON: Light Cycles was created as part of a college assignment to develop a game using Processing, a graphics framework and development environment created for Java. The difficulty can be scaled to suit the players skill level."
},
{
  "name": "H2G2: Pixel Adventure",
  "type": "game",
  "image": "h2g2.jpg",
  "link": "/H2G2/WebBuild.html",
  "buttonText": "Play In Browser",
    "images": ["h2g2A.PNG", "h2g2B.PNG", "h2g2c.png"],
  "shortDescription": "A Hitchhiker's Guide to the Galaxy Game",
  "description": "This game was created with <a href='https://github.com/Xaeonn' target='_blank'>Sam Boles</a> to compete in the national Games Fleadh event. It is a text Adventure with pixel art, some minigamesm, and story created by myself which won the Game Studios Ireland: Best in Original Story award."
}]
